Revit 2027 API
ParameterTypeId.CeilingAttrPatternParam Property
 "Pattern"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CeilingAttrPatternParam { get; }
Public Shared ReadOnly Property CeilingAttrPatternParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CeilingAttrPatternParam {
	ForgeTypeId^ get ();
}
static member CeilingAttrPatternParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace